{
  "scenes": [
    {
      "script": "Hello, I'm Debobrota, and I'll be your instructor for today's lecture that is Understanding Components, virtual DOM and Props. Today's discussion shines a light on a fundamental concept in the React.js framework – Components. Now Lets discuss about React components, React's power lies in its ability to break down the UI into reusable pieces called components, much like how a Lego set consists of interlocking bricks. Each component is responsible for rendering a portion of the user interface, allowing for effective management of complex interfaces by assembling these building blocks together.\n\nImagine you're arranging a party and you've got decorations, food, and music to organize. Think of each of these aspects as components of your party. Similarly, in a React application, you have various components like a navigation bar, a user profile card, or a comments section, each encapsulating design, behavior, and state.\n\n Components are independent and reusable bits of code. They serve the same purpose as JavaScript functions, but work in isolation and return HTML. Components in React come in two types: 'Functional' and 'Class-based'. The beauty of components is in their reusability – once you create a component, you can use it multiple times across different parts of your app like using the same decoration set for different events.",
      "slide": "<div>\n    <h1>Understanding Components in React</h1>\n    <ul>\n        <li><strong>What are Components?</strong>\n            <ul>\n                <li>They are the building blocks of a React UI</li>\n                <li>Responsible for rendering a portion of the UI</li>\n            </ul>\n        </li>\n        <li><strong>Types of Components:</strong>\n            <ul>\n                <li>Functional Components</li>\n                <li>Class-based Components</li>\n            </ul>\n        </li>\n        <li><strong>Reusability of Components:</strong>\n            <ul>\n                <li>Components can be reused throughout the application</li>\n            </ul>\n        </li> \n   <img src=\"https://i.imgur.com/0gDlPmA.png\" style=\"height:200px; width:200px; object-fit:contain;\" />\n </div>",
      "data": null,
      "type": "explanation"
    },
    {
      "script": "I hope that helped clarify the topic we discussed. Now, let's ensure you understand it fully. When you're ready, please let me know your thoughts by clicking the microphone icon and choosing one of the following options: 'Yes, I understood', 'Please repeat the explanation', or 'I need further clarification'.",
      "slide": "<div id=\"clarification_slide\">\n    <h1>Time for Clarification</h1>\n    <h2>Did You Get the Topic?</h2>\n    <ul>\n        <li><strong>Options to Respond:</strong></li>\n        <ul>\n            <li><strong>Yes, I have undertood</strong></li>\n            <li><strong>Please repeat the explanation</strong></li>\n            <li><strong>I did not understand the concept</strong></li>\n        </ul>\n    </ul>\n    <h2>Responding Method:</h2>\n    <ul>\n        <li>Click the <strong>Mic Button</strong> at the screen's middle bottom.</li>\n        <li>Voice out your choice: \"Yes, I got it\", \"Repeat\", or \"Don't Understand\".</li>\n    </ul>\n    <h2>Your Understanding is Key:</h2>\n    <ul>\n        <li>Your feedback is vital for us.</li>\n        <li>Feel free to ask for repetition or further clarification.</li>\n    </ul>\n</div>",
      "data": null,
      "type": "clarification"
    },
    {
      "script": "Are you prepared for a short assessment? Take a moment to think about your answer; here's the question.",
      "slide": "<div>\n    <h1>Components in React</h1>\n    <p>What are components in React and how do they contribute to building user interfaces?</p>\n    <ol>\n      <li>a) Static elements with limited reuse.</li>\n        <li>b) Dynamic elements enabling reusability across the application.</li>\n        <li>c) Only used in class components.</li>\n   <li>d) Primarily for server-side rendering.</li>\n    </ol>\n</div>",
      "data": {
        "answer": ["b", "option b", "b) To use modular UI building blocks"],
        "options": [
          "a) To maintain the internal structure",
          "b) To use modular UI building blocks",
          "c) To style the React elements",
          "d) To handle React lifecycle events"
        ]
      },
      "type": "assessment"
    },
    {
      "script": "You've got it! Understanding the core function of concept is essential, and you've done a fantastic job grasping it. Keep up the excellent work as we move forward!",
      "slide": "<div id=\"feedback_slide\">\n    <h1>You Are Correct!</h1>\n    <img src=\"https://i.ibb.co/LvBxxBH/correct.webp\" alt=\"Correct Answer\">\n</div>",
      "data": null,
      "type": "feedback"
    },
    {
      "script": "It appears there might be some uncertainty, but that's completely fine! Let's review the material again to enhance our understanding, and the correct answer is b) To use modular UI building blocks",
      "slide": "<div>\n    <h1>React Components</h1>\n    <p>What are components in React and how do they contribute to building user interfaces?</p>\n    <ol>\n        <li>a) a) To maintain the internal structure</li>\n        <li>b) To use modular UI building blocks</li>\n        <li>c) To style the React elements</li>\n        <li>d) To handle React lifecycle events</li>\n    </ol>\n</div>\n <div><h1>Answer:- b) To pass data and functions from parent to child components</h1></div>",
      "data": null,
      "type": "revisit"
    }
  ]
}
